## Pandas có tổng cộng bốn accessors:

1. .loc[] chấp nhận label của các row và column và trả về Chuỗi hoặc DataFrame. Bạn có thể sử dụng nó để lấy toàn bộ row hoặc column, cũng như các phần của chúng.
2. .iloc[] chấp nhận các index dựa trên 0 của các row và column và trả về Chuỗi hoặc Dữ liệu. Bạn có thể sử dụng nó để lấy toàn bộ row hoặc column hoặc các phần của chúng.
3. .at[] chấp nhận label của các row và column và trả về một giá trị dữ liệu duy nhất.
4. .iat[] chấp nhận các index dựa trên 0 của các row và column và trả về một giá trị dữ liệu duy nhất.


https://tek4.vn/cach-dung-pandas-python-tu-hoc-tensorflow

In [2]:
import pandas as pd

In [4]:
mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},
...           {'a': 100, 'b': 200, 'c': 300, 'd': 400},
...           {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000}]
df = pd.DataFrame(mydict)
df

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [6]:
dataset  = df

In [7]:
X = dataset.drop(['d'], axis=1)
X

      a     b     c
0     1     2     3
1   100   200   300
2  1000  2000  3000

In [8]:
Y = dataset.iloc[:,-1]
Y

0       4
1     400
2    4000
Name: d, dtype: int64

In [11]:
z = Y = dataset.iloc[1,:]
Y

a    100
b    200
c    300
d    400
Name: 1, dtype: int64

In [13]:
df.iloc[0,:]

a    1
b    2
c    3
d    4
Name: 0, dtype: int64

In [16]:
df.iloc[2]

a    1000
b    2000
c    3000
d    4000
Name: 2, dtype: int64

In [17]:
df.iloc[[0]]

   a  b  c  d
0  1  2  3  4

In [18]:
## Numpy to pandas
import numpy as np
h = [[1,2],[3,4]]
df_h = pd.DataFrame(h)
print('Data Frame:', df_h)

Data Frame:    0  1
0  1  2
1  3  4

In [19]:
## Pandas to numpy
df_h_n = np.array(df_h)
print('Numpy array:', df_h_n)

Numpy array: [[1 2]
 [3 4]]

In [20]:
dic = {'Name': ["Giang", "Hieu"], 'Age': [30, 40]}
pd.DataFrame(data=dic)

    Name  Age
0  Giang   30
1   Hieu   40

In [21]:
## Create date
# Days
dates_d = pd.date_range('20300101', periods=6, freq='D')
print('Day:', dates_d)

Day: DatetimeIndex(['2030-01-01', '2030-01-02', '2030-01-03', '2030-01-04',
               '2030-01-05', '2030-01-06'],
              dtype='datetime64[ns]', freq='D')

In [24]:
# Months
dates_m = pd.date_range('20300101', periods=6, freq='ME')
print('Month:', dates_m)

Month: DatetimeIndex(['2030-01-31', '2030-02-28', '2030-03-31', '2030-04-30',
               '2030-05-31', '2030-06-30'],
              dtype='datetime64[ns]', freq='ME')

In [25]:
random = np.random.randn(6,4)

In [37]:
# Create data with date
df = pd.DataFrame(random,
                  index=dates_m,
                  columns=list('ABCD'))
df

                   A         B         C         D
2030-01-31 -0.301059  0.593634  0.330454  1.239270
2030-02-28 -0.108308 -1.186546  0.460974  0.868685
2030-03-31 -1.505741 -0.058844 -0.377959 -0.184807
2030-04-30 -0.014489  0.000146 -0.485714 -0.304571
2030-05-31  1.850698 -0.667196 -2.427760  1.565575
2030-06-30 -0.033815  0.844747 -0.093060 -1.321849

In [27]:
df.iloc[[0]]

                   A         B         C        D
2030-01-31 -0.301059  0.593634  0.330454  1.23927

In [29]:
df.iloc[[1]]

                   A         B         C         D
2030-02-28 -0.108308 -1.186546  0.460974  0.868685

In [31]:
df.iloc[:, 0]

2030-01-31   -0.301059
2030-02-28   -0.108308
2030-03-31   -1.505741
2030-04-30   -0.014489
2030-05-31    1.850698
2030-06-30   -0.033815
Freq: ME, Name: A, dtype: float64

In [32]:
df.iloc[:, 1]

2030-01-31    0.593634
2030-02-28   -1.186546
2030-03-31   -0.058844
2030-04-30    0.000146
2030-05-31   -0.667196
2030-06-30    0.844747
Freq: ME, Name: B, dtype: float64

In [34]:
df.iloc[:, 2]

2030-01-31    0.330454
2030-02-28    0.460974
2030-03-31   -0.377959
2030-04-30   -0.485714
2030-05-31   -2.427760
2030-06-30   -0.093060
Freq: ME, Name: C, dtype: float64

In [33]:
df.iloc[:, -1]

2030-01-31    1.239270
2030-02-28    0.868685
2030-03-31   -0.184807
2030-04-30   -0.304571
2030-05-31    1.565575
2030-06-30   -1.321849
Freq: ME, Name: D, dtype: float64

In [36]:
df.iloc[-1, 0]

np.float64(-0.033815476751662084)

In [39]:
df.iloc[4, :]

A    1.850698
B   -0.667196
C   -2.427760
D    1.565575
Name: 2030-05-31 00:00:00, dtype: float64

In [40]:
### using a slice for row
df[0:3]

                   A         B         C         D
2030-01-31 -0.301059  0.593634  0.330454  1.239270
2030-02-28 -0.108308 -1.186546  0.460974  0.868685
2030-03-31 -1.505741 -0.058844 -0.377959 -0.184807

In [41]:
## Multi col
df.loc[:,['A','B']]

                   A         B
2030-01-31 -0.301059  0.593634
2030-02-28 -0.108308 -1.186546
2030-03-31 -1.505741 -0.058844
2030-04-30 -0.014489  0.000146
2030-05-31  1.850698 -0.667196
2030-06-30 -0.033815  0.844747

In [42]:
## Multi col
df.loc[:,['A','D']]

                   A         D
2030-01-31 -0.301059  1.239270
2030-02-28 -0.108308  0.868685
2030-03-31 -1.505741 -0.184807
2030-04-30 -0.014489 -0.304571
2030-05-31  1.850698  1.565575
2030-06-30 -0.033815 -1.321849

In [43]:
df.iloc[:, :2] # 2 cột

                   A         B
2030-01-31 -0.301059  0.593634
2030-02-28 -0.108308 -1.186546
2030-03-31 -1.505741 -0.058844
2030-04-30 -0.014489  0.000146
2030-05-31  1.850698 -0.667196
2030-06-30 -0.033815  0.844747

In [44]:
df.iloc[:2, :] # 2 hàng

                   A         B         C         D
2030-01-31 -0.301059  0.593634  0.330454  1.239270
2030-02-28 -0.108308 -1.186546  0.460974  0.868685

In [45]:
df.drop(columns=['A', 'C'])

                   B         D
2030-01-31  0.593634  1.239270
2030-02-28 -1.186546  0.868685
2030-03-31 -0.058844 -0.184807
2030-04-30  0.000146 -0.304571
2030-05-31 -0.667196  1.565575
2030-06-30  0.844747 -1.321849

## Concatenation

In [46]:
import numpy as np
df1 = pd.DataFrame({'name': ['John', 'Smith','Paul'],
                     'Age': ['25', '30', '50']},
                    index=[0, 1, 2])
df2 = pd.DataFrame({'name': ['Adam', 'Smith' ],
                     'Age': ['26', '11']},
                    index=[3, 4])

In [47]:
df1

    name Age
0   John  25
1  Smith  30
2   Paul  50

In [48]:
df2

    name Age
3   Adam  26
4  Smith  11

In [49]:
df_concat = pd.concat([df1,df2])
df_concat

    name Age
0   John  25
1  Smith  30
2   Paul  50
3   Adam  26
4  Smith  11

In [50]:
df_concat.drop_duplicates('name')

    name Age
0   John  25
1  Smith  30
2   Paul  50
3   Adam  26

In [51]:
df_concat.sort_values('Age')

    name Age
4  Smith  11
0   John  25
3   Adam  26
1  Smith  30
2   Paul  50

In [52]:
df_concat.sort_values('name')

    name Age
3   Adam  26
0   John  25
2   Paul  50
1  Smith  30
4  Smith  11

In [53]:
df_concat.rename(columns={"name": "Surname", "Age": "Age_ppl"})

  Surname Age_ppl
0    John      25
1   Smith      30
2    Paul      50
3    Adam      26
4   Smith      11

In [54]:
df.tail(3)

                   A         B         C         D
2030-04-30 -0.014489  0.000146 -0.485714 -0.304571
2030-05-31  1.850698 -0.667196 -2.427760  1.565575
2030-06-30 -0.033815  0.844747 -0.093060 -1.321849